app/controllers/members_controller.rb

  def index
    @member = Member.all
---
SELECT "members".* FROM "members"

  def create
    @member = Member.new(member_params)

    respond_to do |format|
      if @member.save
---
INSERT INTO "members" ("first_name", "last_name", "username", "email", "mobile_phone", "created_at", "updated_at", "profile_image_id", "profile_image_filename", "profile_image_content_type") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @member.update(member_params)
---
UPDATE "members" SET "profile_image_id" = ?, "profile_image_filename" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["profile_image_id", "b4fca44eee2ad874f3c6baa217191dd75741460e436c4d9849a43e2b05f2"], ["profile_image_filename", "dog2.jpg"], ["updated_at", "2018-03-27 03:33:28.752801"], ["id", 3]]

    def set_member
      @member = Member.find(params[:id])
---
SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]