app/controllers/posts_controller.rb

INSERT INTO "posts" ("captions", "created_at", "updated_at", "post_image_id", "post_image_content_type") VALUES (?, ?, ?, ?, ?)  [["captions", "pandaaa"], ["created_at", "2018-03-26 06:58:05.228837"], ["updated_at", "2018-03-26 06:58:05.228837"], ["post_image_id", 718], ["post_image_content_type", "image/jpeg"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "post_image_id" = ?, "post_image_content_type" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["post_image_id", 0], ["post_image_content_type", "image/jpeg"], ["updated_at", "2018-03-26 07:16:36.669323"], ["id", 10]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)